<template>
  <div>
    <mini-nav></mini-nav>
    <main>
      <header class="main-header">
        <div class="wrap">
          <ul class="breadcrumbs">
            <li>
              <a href="/index">首页</a>
            </li>
            <li><a href="/category">我是需求方</a></li>
            <li><a href="/Publish">发布项目</a></li>
          </ul>
          <form action="" method="get" class="main-header-search">
            <label for="search">
              <input
                type="search"
                id="search"
                name="keyword"
                placeholder="输入问题关键字，找到答案"
              />
              <svg
                style="position: absolute; top: 8px; left: 10px"
                t="1621909625742"
                class="icon"
                viewBox="0 0 1024 1024"
                version="1.1"
                xmlns="http://www.w3.org/2000/svg"
                p-id="5849"
                width="20"
                height="20"
              >
                <path
                  d="M464.213333 808.96c-88.746667 0-177.493333-34.133333-245.76-102.4-133.12-133.12-133.12-354.986667 0-488.106667 133.12-133.12 354.986667-133.12 488.106667 0 133.12 133.12 133.12 354.986667 0 488.106667-64.853333 68.266667-153.6 102.4-242.346667 102.4z m0-621.226667c-71.68 0-143.36 27.306667-194.56 81.92-109.226667 109.226667-109.226667 283.306667 0 392.533334 109.226667 109.226667 283.306667 109.226667 392.533334 0 109.226667-109.226667 109.226667-283.306667 0-392.533334-54.613333-54.613333-126.293333-81.92-197.973334-81.92z"
                  p-id="5850"
                  fill="#FFFFFF"
                ></path>
                <path
                  d="M904.533333 938.666667c-10.24 0-17.066667-3.413333-23.893333-10.24l-191.146667-191.146667c-13.653333-13.653333-13.653333-34.133333 0-47.786667s34.133333-13.653333 47.786667 0l191.146667 191.146667c13.653333 13.653333 13.653333 34.133333 0 47.786667-6.826667 6.826667-13.653333 10.24-23.893334 10.24z"
                  p-id="5851"
                  fill="#FFFFFF"
                ></path>
              </svg>
            </label>
            <input type="submit" value="搜索" />
          </form>
        </div>
      </header>
      <section class="content">
        <div class="wrap clearfix">
          <div class="category-section-list">
            <div class="category-section category">
              <h2>
                <a href="/">我是需求方</a>
              </h2>
              <ul>
                <li class="section">
                  <h3>
                    <a href="/ListMenu">发布项目</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">招募开发</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">支付款项</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">开发项目</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">验收项目</a>
                  </h3>
                </li>
              </ul>
            </div>
            <div class="category-section category">
              <h2>
                <a href="">我是开发者</a>
              </h2>
              <ul>
                <li class="section">
                  <h3>
                    <a href="">注册认证</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">报名接单</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">开发项目</a>
                  </h3>
                </li>
                <li class="section">
                  <h3>
                    <a href="">验收项目</a>
                  </h3>
                </li>
              </ul>
            </div>
          </div>
          <section class="content-main fr">
            <article class="article">
              <header class="article-header">
                <h2>需求方项目合作须知</h2>
                <p class="article-header-info"></p>
              </header>
              <div class="article-content">
                <div class="original-content">
                  <p>
                    1、需求方在平台发布项目，有责任对其提供的内容自行审查，平台会对需求方发布的项目进行内容审核，对于项目内容信息不符合要求，平台有权拒绝通过，项目即使审核通过，需求方也应依法对其提供的任何信息承担全部责任。
                  </p>
                  <p>
                    2、需求方与开发者在开启项目合作前必须有明确的需求文档，积极与开发者沟通项目细节，并以书面文档的形式体现。项目合作过程中一旦产生纠纷需平台介入调解的，平台将以双方确认的需求文档作为评判标准。如中途双方同意需求变更的，需及时将变更内容进行补充并进行确认。若双方没有需求档案或需求不明确而产生项目纠纷的，责任由交易双方共同承担。
                  </p>
                  <p>
                    3、需求方与开发者在开发阶段合作前，如双方有另外制定其他协议时，协议条款需遵从平台规则以及平台交易流程，若协议中存在违反平台规定或流程，平台不予认可该项协议条款。如因交易合同产生项目纠纷，平台有权不予受理。
                  </p>
                  <p>
                    4、平台是一个纯撮合的平台，对于具体的开发任务不进行干涉。需求方与开发者在确认合作时，双方务必签订合同和保密协议，保留通过司法途径向对方发起诉讼的权利。
                  </p>
                  <p>
                    5、项目在开发过程中，需求方有义务监督开发者工作进度，避免项目停滞或开发者未进行实际工作的情况出现。
                  </p>
                  <p>
                    6、需求方若有安排人员与平台开发者进行对接的，需求方有义务协调双方的工作，不得以自己没时间、不懂技术、需要对接人员自己进行沟通等理由影响项目进度，若需求方未协调好双方工作导致项目延期或无法完成项目，责任应由需求方承担。
                  </p>
                  <p>
                    7、平台为了保障双方的权益，要求需求方采取托管项目款的方式来推进项目。若开发者未提交任何交付物就提交项目验收申请时，请勿操作通过验收，一旦确认通过验收，阶段款项将会支付给开发者且无法追回，由此造成的损失将由需求方自行承担。
                  </p>
                  <p>
                    8、开发者提交项目验收申请后，需求方有义务及时进行验收并提出反馈，验收时间双方可进行协商，灵活处理。如双方对于验收时间意见不一致，需平台介入时，平台将以开发者第一次提交验收申请开始计算，在10个自然日内需要验收完成，最多不超过15个自然日。
                  </p>
                </div>
                <p class="next-prev-wrap">
                  <a href="" class="prev" title="如何发布项目需求？">
                    上一篇 如何发布项目需求？
                  </a>
                </p>
                <p class="next-prev-wrap">
                  <a href="" class="next" title="如何给项目估价？">
                    下一篇 如何给项目估价？
                  </a>
                </p>
              </div>
              <footer class="article-footer">
                <ul class="share-list">
                  <li class="wechat">
                    <a href="">
                      <svg
                        t="1625477695896"
                        class="icon"
                        viewBox="0 0 1024 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="2425"
                        width="20"
                        height="20"
                      >
                        <path
                          d="M1010.816 628.032c0-141.248-141.312-256.256-299.904-256.256-168 0-300.288 115.136-300.288 256.192 0 141.44 132.288 256.256 300.288 256.256 35.2 0 70.656-8.96 105.984-17.728l96.832 52.992-26.624-88.192c70.912-53.184 123.712-123.712 123.712-203.328zM617.984 588.8a40 40 0 1 1 0-80 40 40 0 0 1 0 80z m194.304-0.32a40 40 0 1 1 0-80 40 40 0 0 1 0 80z"
                          fill="#00C800"
                          p-id="2426"
                        ></path>
                        <path
                          d="M366.272 106.88C172.224 106.88 13.184 239.168 13.184 407.168c0 97.024 52.928 176.64 141.312 238.464l-35.328 106.176 123.456-61.888c44.16 8.704 79.552 17.664 123.648 17.664 11.136 0 22.144-0.512 33.024-1.408a262.784 262.784 0 0 1-10.88-73.984c0-154.24 132.48-279.488 300.16-279.488 11.52 0 22.848 0.768 34.048 2.112-30.656-142.208-182.72-247.936-356.352-247.936zM247.68 349.184a48 48 0 1 1 0-96 48 48 0 0 1 0 96z m246.592 0a48 48 0 1 1 0-96 48 48 0 0 1 0 96z"
                          fill="#00C800"
                          p-id="2427"
                        ></path>
                      </svg>
                    </a>
                  </li>
                  <li class="sina">
                    <a href="">
                      <svg
                        t="1625477982961"
                        class="icon"
                        viewBox="0 0 1178 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="3288"
                        width="20"
                        height="20"
                      >
                        <path
                          d="M469.134204 1023.218261a675.005718 675.005718 0 0 1-287.54707-56.299742A310.285253 310.285253 0 0 1 9.095273 769.642038c-25.102955-96.63728 3.00144-208.281762 81.266269-322.882207A754.907695 754.907695 0 0 1 314.969319 226.472308a375.225505 375.225505 0 0 1 176.584734-61.074761 96.000611 96.000611 0 0 1 23.2839 2.455724c78.856021 23.147471 69.533365 106.687557 65.576921 142.341029V312.83193c-0.454764 4.138349-0.864051 8.094793-0.864051 10.595993a51.524724 51.524724 0 0 0 0 34.607516 6.275739 6.275739 0 0 0 5.13883 2.546676 19.645791 19.645791 0 0 0 10.959804-4.911447 378.090517 378.090517 0 0 1 174.765679-44.521364 125.241915 125.241915 0 0 1 83.221752 23.011042c39.700869 35.698948 20.600794 104.095404 10.323135 140.976738a68.942173 68.942173 0 0 0-4.911447 25.421289c0 2.955964 3.956444 3.456204 11.096233 4.547637a177.357832 177.357832 0 0 1 117.874744 70.670275 145.024135 145.024135 0 0 1 32.652032 118.9207c-11.323615 82.948894-76.172915 168.671846-177.812596 235.158294a709.15847 709.15847 0 0 1-373.724785 93.362982z m29.059398-557.040021c-14.688867 0-29.42321 0.636669-43.793741 1.819055-191.2736 21.874133-338.344172 146.979619-327.839131 278.952036C136.429101 869.462664 271.493912 958.187056 447.942217 958.187056c14.734343 0 29.559639-0.636669 44.066599-1.864531a449.442937 449.442937 0 0 0 240.47903-97.182996 218.013704 218.013704 0 0 0 87.314625-181.632611c-9.731943-122.331428-144.978659-211.101296-321.608869-211.101296zM446.759831 888.608214a165.98874 165.98874 0 0 1-169.717802-125.42382 195.230044 195.230044 0 0 1 145.115087-219.878235 222.379435 222.379435 0 0 1 56.072361-7.367172 165.852311 165.852311 0 0 1 169.62685 125.378344 192.728844 192.728844 0 0 1-145.069612 219.969188 220.242046 220.242046 0 0 1-56.026884 7.321695z m-30.92393-192.819796a64.985729 64.985729 0 0 0-20.600794 3.319774A67.214071 67.214071 0 0 0 346.893729 768.550605a52.979968 52.979968 0 0 0 54.57164 40.928731 64.985729 64.985729 0 0 0 20.600795-3.319775 57.618557 57.618557 0 0 0 37.563479-23.829617 61.984288 61.984288 0 0 0 10.732423-45.93113 52.843539 52.843539 0 0 0-54.526165-40.610396z m89.861302-30.332737a26.467246 26.467246 0 0 0-8.367652 1.455243 27.28582 27.28582 0 0 0-21.510321 26.831057 32.742984 32.742984 0 0 0 32.333697 16.053158 23.602235 23.602235 0 0 0 19.964125-11.14171 16.235063 16.235063 0 0 0 1.50072-15.734823 28.832017 28.832017 0 0 0-23.920569-17.644831z m617.569066-198.140532a48.932571 48.932571 0 0 1-39.655392-20.28246 45.885654 45.885654 0 0 1-4.547637-43.202549 249.801685 249.801685 0 0 0-43.020643-230.610657 186.725964 186.725964 0 0 0-159.167285-71.716231c-16.189587 0-32.470126 1.091433-44.839698 2.046436h-5.502641a44.475887 44.475887 0 0 1-47.386374-42.111116A55.572121 55.572121 0 0 1 826.57845 1.591673c11.050757-1.045956 22.28342-1.591673 33.379653-1.591673a316.33361 316.33361 0 0 1 251.393358 124.923581c73.171475 83.49461 76.35482 248.892158 53.753066 311.103827a43.657312 43.657312 0 0 1-41.838258 31.287741z m-141.795313-60.074281a49.159953 49.159953 0 0 1-38.609436-20.100554 22.328896 22.328896 0 0 1-3.547156-20.828176 93.181076 93.181076 0 0 0-5.548117-84.358662 81.084363 81.084363 0 0 0-68.214551-28.832016c-3.410728 0-7.412648 0-12.369572 0.591192-1.864531 0-3.729062 0.227382-5.548116 0.227382a34.789421 34.789421 0 0 1-37.381574-33.970846 43.793742 43.793742 0 0 1 37.518003-46.749705 124.286911 124.286911 0 0 1 21.692227-1.819055 199.732205 199.732205 0 0 1 102.048968 33.970846c46.385895 36.017283 76.127439 132.790992 43.020643 182.360232a38.018243 38.018243 0 0 1-33.061319 19.509362z"
                          p-id="3289"
                          fill="#ff595f"
                        ></path>
                      </svg>
                    </a>
                  </li>
                  <li class="qq">
                    <a href="">
                      <svg
                        t="1625478297421"
                        class="icon"
                        viewBox="0 0 1024 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="4268"
                        width="20"
                        height="20"
                      >
                        <path
                          d="M964.437333 784.554667c-20.48 11.349333-54.784-13.653333-86.698666-61.610667-11.434667 50.176-43.349333 95.829333-86.698667 132.266667 45.653333 15.957333 75.264 45.653333 75.264 75.264 0 52.48-82.090667 93.525333-182.442667 93.525333-91.221333 0-166.4-34.133333-180.138666-77.568h-22.784c-13.653333 43.349333-89.002667 77.568-180.224 77.568-100.352 0-182.442667-41.045333-182.442667-93.525333 0-31.914667 29.696-59.306667 75.264-75.264-43.349333-36.437333-75.264-82.090667-86.613333-132.266667-32 45.653333-66.133333 70.741333-86.698667 61.610667-31.914667-15.957333-25.088-102.656 13.653333-191.573334 29.696-70.741333 70.741333-123.136 102.656-134.570666v-13.653334c0-27.392 6.826667-52.48 20.48-73.045333v-4.522667c0-13.653333 2.304-25.088 9.130667-34.218666C177.578667 145.92 298.410667 0 494.592 0c196.096 0 317.013333 145.92 326.144 330.666667a84.48 84.48 0 0 1 9.130667 34.218666v4.608c13.653333 20.48 20.48 45.568 20.48 72.96v13.653334c31.914667 11.434667 73.045333 63.914667 102.656 134.570666 36.522667 91.306667 43.349333 177.92 11.434666 193.877334z"
                          fill="#00c8f2"
                          p-id="4269"
                        ></path>
                      </svg>
                    </a>
                  </li>
                </ul>
              </footer>
            </article>
          </section>
        </div>
      </section>
    </main>
  </div>
</template>
<script>
import miniNav from "../components/MiniNav.vue";
export default {
  components: {
    miniNav,
  },
  data() {
    return {
      all: true,
    };
  },
  methods: {
    change() {
      this.all = !this.all;
    },
  },
};
</script>
<style lang="scss" scoped>
main {
  display: block;
  .main-header {
    height: 88px;
    background: #4a99ed;
    .wrap {
      width: 1080px;
      margin: 0 auto;
      .breadcrumbs {
        float: left;
        margin-bottom: 0;
        li {
          font-size: 16px;
          color: #fff;
          line-height: 88px;
          float: left;
          a {
            margin-right: 5px;
          }
        }
        li::before {
          content: ">";
          float: left;
          margin-right: 5px;
        }
        li:nth-child(1)::before {
          content: "";
        }
        a {
          color: #fff;
        }
      }
      .breadcrumbs::after {
        content: ".";
        display: block;
        height: 0;
        clear: both;
        visibility: hidden;
      }
      .main-header-search {
        float: right;
        margin-top: 25px;
        position: relative;
        input {
          height: 38px;
          vertical-align: middle;
          width: 260px;
          -webkit-box-sizing: border-box;
          -moz-box-sizing: border-box;
          box-sizing: border-box;
          background: rgba(255, 255, 255, 0.4);
          border-radius: 40px;
          padding-left: 30px;
          border: none;
          padding-right: 10px;
          -webkit-transition: all ease 0.4s;
          -moz-transition: all ease 0.4s;
          transition: all ease 0.4s;
        }
        input:focus {
          background: #fff;
          color: #374051;
        }
        input[type="submit"] {
          visibility: hidden;
          position: absolute;
          right: 0;
          height: 38px;
          width: 30px;
          display: inline-block;
        }
        input[type="submit"]:focus {
          box-shadow: 0 0 3px rgba(33, 211, 118, 0.35);
        }
        label:focus {
          color: #777;
        }
      }
    }
  }
  .content {
    padding-top: 40px;
    padding-bottom: 50px;
    .wrap {
      width: 1080px;
      margin: 0 auto;
      .category-section-list {
        float: left;
        width: 25%;
        .category-section {
          width: 100%;
          padding: 0;
          margin-bottom: 25px;
          h2 {
            padding-left: 8px;
            border-left: 3px solid #21d376;
            font-size: 16px;
            margin-bottom: 15px;
            border-bottom: none;
            padding-bottom: 0;
            font-weight: bold;
            a {
              color: #374051 !important;
            }
          }
          .section {
            background: #f7f7f6;
            border-radius: 3px;
            margin-bottom: 6px;
            h3 {
              position: relative;
              a {
                padding: 0 15px;
                color: #307acd;
                display: block;
                height: 36px;
                line-height: 36px;
                font-size: 14px;
                white-space: nowrap;
                text-overflow: ellipsis;
                overflow: hidden;
                border-radius: 3px;
              }
              a:hover {
                color: #448ee1;
              }
            }
          }
        }
      }
      .fr {
        float: right;
      }
      .content-main {
        width: 70%;
        header {
          h2 {
            line-height: 1;
            border-bottom: none;
            padding-bottom: 0;
          }
        }
        .article-header {
          h2 {
            padding-right: 0px;
            position: relative;
            padding-right: 70px;
            margin-bottom: 15px;
            padding-bottom: 10px;
            font-size: 24px;
            padding-left: 0;
            border-bottom: 1px solid #e2eaec;
            line-height: 1.5em;
            font-weight: bold;
          }
          .article-header-info {
            font-size: 12px;
            color: #777;
            margin-bottom: 30px;
          }
        }
        .article-content {
          line-height: 1.8em;
          font-size: 16px;
          padding-bottom: 50px;
          div {
            margin-bottom: 16px;
          }
          p {
            margin-bottom: 16px;
          }
        }
      }
    }
  }
}
header,
div,
ul,
li,
form,
label,
section,
h2,
h3,
nav,
article,
p {
  margin: 0;
  padding: 0;
  border: 0;
  font-size: 100%;
  font-weight: 400;
  background: 0 0;
  word-break: break-word;
  display: block;
}
a {
  font-size: 100%;
  vertical-align: baseline;
  background: 0 0;
  text-decoration: none;
  padding: 0;
  margin: 0;
}
a:hover {
  text-decoration: underline;
}
label {
  cursor: pointer;
}
input[type="search"] {
  appearance: none;
}
section {
  display: block;
}
ul {
  list-style: none;
}
</style>